app/controllers/quiz_controller.rb

INSERT INTO "articles" ("question", "answer", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["question", "Куда ты холоден и cyx!"], ["answer", "Русскому геснеру"], ["created_at", "2017-12-27 12:37:41.267676"], ["updated_at", "2017-12-27 12:37:41.267676"]]
SELECT "articles".* FROM "articles"
---
def index
@coming = Array.new
@names= Array.new
@a=params
@b
search
@param={'question'=>@a[:question],'answer'=>@b}
@article = Article.new({ :question=>@a[:question],:answer=>@b})
@article.save
@articles = Article.all